export const timeList = [
  {
    first: { start: '08:00', end: '08:45' },
    second: { start: '08:55', end: '09:40' }
  },
  {
    first: { start: '10:05', end: '10:50' },
    second: { start: '11:00', end: '11:45' }
  },
  {
    first: { start: '14:00', end: '14:45' },
    second: { start: '14:55', end: '15:40' }
  },
  {
    first: { start: '16:05', end: '16:50' },
    second: { start: '17:00', end: '17:45' }
  },
  {
    first: { start: '19:00', end: '19:45' },
    second: { start: '19:55', end: '20:40' }
  },
  {
    first: { start: '20:50', end: '21:35' },
    second: { start: '21:45', end: '22:30' }
  }
]

export const agenda = [
  {
    type: 'agenda',
    name: '这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排',
    location:
      '啊啊啊啊啊dadsadsadsa这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排这是我的个人日程安排',
    x: 1,
    y: 1,
    z: [1, 2]
  },
  {
    type: 'agenda',
    name: '这是我的个人日程安排',
    x: 3,
    y: 1,
    z: [1, 2]
  },
  {
    type: 'agenda',
    name: '这是我的个人日程安排',
    x: 5,
    y: 3,
    z: [1, 2, 3, 4, 5, 6, 7, 8]
  },
  {
    type: 'agenda',
    name: '这是我的个人日程安排',
    x: 6,
    y: 2,
    z: [1, 2, 3, 4, 5, 6, 7, 8]
  },
  {
    type: 'agenda',
    name: '这是我的个人日程安排',
    location: '啊啊啊啊',
    x: 2,
    y: 3,
    z: [1, 2, 3, 4, 5, 6, 7, 8]
  },
  {
    type: 'agenda',
    name: '这是我的个人日程安排',
    location: '行者楼102',
    x: 4,
    y: 5,
    z: [1, 2, 3, 4, 5, 6, 16, 13]
  }
]

export const course = [
  {
    name: '数据结构',
    location: '行者楼102',
    teacher: '卢丹',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 4,
    y: 2,
    z: [1, 2, 3, 4, 5, 6, 7, 8]
  },
  {
    name: '300年来的世界文学',
    location: '行者楼103',
    teacher: '萧婷婷',
    x: 2,
    y: 4,
    z: [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16]
  },
  {
    name: '300年来的世界文学',
    location: '行者楼102',
    teacher: '萧婷婷',
    x: 2,
    y: 6,
    z: [16]
  },
  {
    name: '马克思主义基本原理',
    location: '明善图书馆408',
    teacher: '黄秋燕',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 3,
    y: 1,
    z: [16, 2, 4, 6, 8, 10, 12, 14]
  },
  {
    name: '数智化企业的人力资源管理',
    location: '南江204',
    teacher: '肖心楠',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 1,
    y: 3,
    z: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]
  },
  {
    name: '数据结构',
    location: '贤者楼320',
    teacher: '卢丹',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 5,
    y: 1,
    z: [16, 9, 11, 12, 13, 14, 15]
  },
  {
    name: '数据结构',
    location: '贤者楼325',
    teacher: '卢丹',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 3,
    y: 2,
    z: [11]
  },
  {
    name: '形势与政策（3）',
    location: '行者楼202',
    teacher: '刘玥阳',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 1,
    y: 5,
    z: [9, 10, 11, 12]
  },
  {
    name: '概率论与数理统计',
    location: '行者楼304',
    teacher: '安军',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 1,
    y: 6,
    z: [5]
  },
  {
    name: '概率论与数理统计',
    location: '行者楼304',
    teacher: '安军',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 2,
    y: 1,
    z: [16, 2, 4, 8, 10, 12, 14]
  },
  {
    name: '大学英语（3）',
    location: '明善图书馆410',
    teacher: '姚长红',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 3,
    y: 1,
    z: [1, 3, 5, 7, 9, 11, 13, 15]
  },
  {
    name: '经济学原理',
    location: '行者楼501',
    teacher: '万乙豆',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 5,
    y: 2,
    z: [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16]
  },
  {
    name: '经济学原理',
    location: '行者楼106',
    teacher: '万乙豆',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 4,
    y: 2,
    z: [11]
  },
  {
    name: '经济学原理',
    location: '行者楼102',
    teacher: '万乙豆',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 2,
    y: 3,
    z: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]
  },
  {
    name: '概率论与数理统计',
    location: '行者楼304',
    teacher: '安军',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 1,
    y: 4,
    z: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]
  },
  {
    name: '拓展训练',
    location: '营地教育公园',
    teacher: '郑玉婷',
    class: '2024级信息管理与信息系统1班',
    x: 7,
    y: 1,
    z: [9]
  },
  {
    name: '拓展训练',
    location: '营地教育公园',
    teacher: '郑玉婷',
    class: '2024级信息管理与信息系统1班',
    x: 7,
    y: 2,
    z: [9]
  },
  {
    name: '拓展训练',
    location: '营地教育公园',
    teacher: '郑玉婷',
    class: '2024级信息管理与信息系统1班',
    x: 7,
    y: 3,
    z: [9]
  },
  {
    name: '拓展训练',
    location: '营地教育公园',
    teacher: '郑玉婷',
    class: '2024级信息管理与信息系统1班',
    x: 7,
    y: 4,
    z: [9]
  },
  {
    name: '拓展训练',
    location: '营地教育公园',
    teacher: '郑玉婷',
    class: '2024级信息管理与信息系统1班',
    x: 6,
    y: 1,
    z: [9]
  },
  {
    name: '拓展训练',
    location: '营地教育公园',
    teacher: '郑玉婷',
    class: '2024级信息管理与信息系统1班',
    x: 6,
    y: 2,
    z: [9]
  },
  {
    name: '拓展训练',
    location: '营地教育公园',
    teacher: '郑玉婷',
    class: '2024级信息管理与信息系统1班',
    x: 6,
    y: 3,
    z: [9]
  },
  {
    name: '拓展训练',
    location: '营地教育公园',
    teacher: '郑玉婷',
    class: '2024级信息管理与信息系统1班',
    x: 6,
    y: 4,
    z: [9]
  },
  {
    name: '管理运筹学',
    location: '行者楼105',
    teacher: '郑媛媛',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 4,
    y: 2,
    z: [16]
  },
  {
    name: '管理运筹学',
    location: '行者楼104',
    teacher: '郑媛媛',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 4,
    y: 1,
    z: [1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16]
  },
  {
    name: '大学英语（3）',
    location: '明善图书馆410',
    teacher: '姚长红',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 2,
    y: 5,
    z: [1, 2, 3, 4, 5, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]
  },
  {
    name: '大学英语（3）',
    location: '明善图书馆410',
    teacher: '姚长红',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 2,
    y: 6,
    z: [14]
  },
  {
    name: '幸福课',
    location: '行者楼508',
    teacher: '张新瑞',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 2,
    y: 2,
    z: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]
  },
  {
    name: '马克思主义基本原理',
    location: '行者楼201',
    teacher: '黄秋燕',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 1,
    y: 6,
    z: [9]
  },
  {
    name: '马克思主义基本原理',
    location: '仁者楼505',
    teacher: '黄秋燕',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 4,
    y: 3,
    z: [1, 2, 3, 4, 5, 6, 8, 9, 11, 12, 13, 14, 15, 16]
  },
  {
    name: '马克思主义基本原理',
    location: '行者楼503',
    teacher: '黄秋燕',
    class: '2024级信息管理与信息系统1班,2024级信息管理与信息系统2班',
    x: 3,
    y: 3,
    z: [11]
  },
  {
    name: '篮球',
    location: '运动场',
    teacher: '张炜哲',
    x: 4,
    y: 4,
    z: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16]
  }
]
